[
    "What did one plate whisper to the other plate? Dinner is on me.",
    "What's 90 degrees but covered with ice? The North and South Poles.",
    "What happened when the blue ship and the red ship collided at sea? Their crews were marooned.",
    "What are the strongest days of the week? Saturday and Sunday. All the others are weekdays.",
    "What's the difference between the bird flu and the swine flu? One requires tweetment and the other an oinkment.",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one. ",
    "How do you stop a bull from charging? Cancel its credit card.",
    "How do you follow Will Smith in the Mud? Follow the fresh prints.",
    "What do you call a line of men waiting to get haircuts? A barberqueue.",
    "Why do seagulls fly over the sea? If they flew over the bay, they would be bagels.",
    "Am I the only man my wife has ever dated? Unfortunately yes, she said the others were all nines or tens! ",
    "I'm thinking I should do lunges to stay in shape. That would be a big step forward. ",
    "What's the difference between a man's wallet before and after kids? There are pictures where the money used to be.  ",
    "What did the baby corn say to the mama corn? Where's popcorn?",
    "I wish my gray hair started in Las Vegas because what happens in Vegas, stays in Vegas. ",
    "What vegetable is cool, but not that cool? Radish.",
    "My kid is blaming me for ruining their birthday. That's ridiculous, I didn't even know it was today!",
    "I haven't spoken to my wife in four years. I thought it would be rude to interrupt her!",
    "My kid gave me a 'World's Best Dad' mug. At least she inherited my sense of humor. ",
    "When a toddler reaches the \"why?\" stage, it's like opening a bottle of champagne—once it's uncorked, there's no going back. ",
    "What do you call two monkeys who share an Amazon Prime account? Prime mates.",
    "You can't spell par entry without \"try.\"",
    "How do you measure the mass of an influencer's following? By Instagrams!",
    "How do you teach kids about taxes? Eat 38% of their ice cream. ",
    "Two sheep walk into a—baaaa.",
    "What do you call a beehive without an exit? Un-bee-lievable.",
    "What did the seal with one fin say to the shark? If seal is broken, do not consume.",
    "I wish my kids weren't offended by my Frozen jokes. They really need to let it go!",
    " Why did the football coach go to the bank? To get his quarter back.",
    "Why can't a leopard hide? He's always spotted.",
    "Air used to be free at the gas station, now it costs 2.50. You want to know why? Inflation.",
    "I tried to get a smart car the other day but they sold out too fast. Why? I guess I'm just a bit slow.",
    "I told my wife that a husband is like a fine wine: we just get better with age. The next day she locked me in the cellar. ",
    "Why does a husband lead a dog's life? He comes in with muddy feet, gets comfortable by the fire, and waits to be fed.",
    "Did you hear about the claustrophobic astronaut? He just wanted a bit more space.",
    "What does the stork do once he's delivered the baby?  He lies on the couch and drinks a beer! ",
    "How many telemarketers does it take to change a light bulb? Only one, but he has to do it during dinner. ",
    "Why did the orange lose the race? It ran out of juice.",
    "How you fix a broken pumpkin? With a pumpkin patch.",
    "Why are fish so smart? They live in schools!",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
    "Why did the man fall down the well? Because he couldn't see that well!",
    "Why do peppers make such good archers? Because they habanero.",
    "What did the sink tell the toilet? You look flushed!",
    "Where do boats go when they're sick? To the dock.",
    "What has ears but cannot hear? A cornfield!",
    "Stop looking for the perfect match; use a lighter.",
    "Can February March? No, but April May!",
    "Why was 6 afraid of 7? Because 7 ate nine!",
    "I'm so good at sleeping that I do it with my eyes closed.",
    "Try the seafood diet—you see food, then you eat it.",
    "What do you call a pencil with two erasers? Pointless.",
    "Did you hear the one about the roof? Never mind, it's over your head.",
    "What's brown and sticky? A stick.",
    "I hated facial hair but then it grew on me.",
    "It really takes guts to be an organ donor.",
    "Did you hear the rumor about butter? Well, I'm not going to go spreading it!",
    "What did the plumber say to the singer? Nice pipes.",
    "I was going to tell a time-traveling joke, but you didn't like it.",
    "How do you deal with a fear of speed bumps? You slowly get over it.",
    "I ordered a chicken and an egg online. I'll let you know.",
    "I'm reading an anti-gravity book. I can't put it down!",
    "I'd avoid the sushi if I were you. It's a little fishy!",
    "What state is known for its small drinks? Minnesota.",
    "What's Forrest Gump's password? 1forrest1",
    "What do houses wear? An address.",
    "What did the two pieces of bread say on their wedding day? It was loaf at first sight. ",
    "What kind of shoes does a lazy person wear? Loafers.",
    "What did the ocean say to the beach? Nothing, it just waved.",
    "What happens when a snowman throws a tantrum? He has a meltdown.",
    "Why'd the fisherman order the halibut? Just for the halibut!",
    "Why is Peter Pan always flying? Because he Neverlands.",
    "What do you call a sleeping bull? A bulldozer.",
    "How do you throw a party in outer space? You planet.",
    "Why was the broom late to class? It over-swept.",
    "How do you make an octopus laugh? With ten-tickles!",
    "What do you say to a rabbit on its birthday? Hoppy Birthday!",
    "What type of tree fits in your hand? A palm tree.",
    "Why couldn't the bicycle stand up by itself? It was two tired!",
    "Wanna hear a joke about construction? I'm still workin' on it!",
    "What do you call a fake noodle? An impasta. ",
    "How does a lawyer say goodbye? I'll be suing ya!",
    "You can't trust atoms. They make up everything!",
    "What made the tomato blush? It saw the salad dressing.",
    "Can I dive in this pool? It deep-ends.",
    "What did the buffalo say to its son when he left? Bison!",
    "Why do vampires always seem sick? They're coffin.",
    "What musical instrument do you find in the bathroom? A tuba toothpaste!",
    "Which state has the most streets? Rhode Island.",
    "How do astronomers organize a party? They planet.",
    "Why do bees have sticky hair? Because they use a honeycomb.",
    "Why do melons have weddings? They cantaloupe!",
    "What did the police officer say to her belly button? You're under a vest! ",
    "What do you call a fibbing cat? A lion.",
    "What does a nosey pepper do? It gets jalapeño business.",
    "If a child refuses to nap, are they guilty of resisting a rest?",
    "Did you hear about the outlet who got in a fight with the power cord? He thought he could socket to him.",
    "What do you call a fancy fish? So-fish-ticated.",
    "If April showers bring May flowers, what do May flowers bring? Pilgrims.",
    "How do you make 7 even? You take away the s.",
    "What kind of cars do eggs drive? Yolkswagens.",
    "Where do math teachers go on vacation? Times Square.",
    "Why was the stadium so hot after the game? Because all the fans left.",
    "The coach went to the bank to get his quarterback.",
    "I asked my dog what's two minus two. He said nothing.",
    "The first thing Santa's elves learn in school is their elf-abet.",
    "Ghosts are bad liars because you can see right through them.",
    "Shouldn’t the “roof” of your mouth actually be called the ceiling? ",
    "All vampires keep their money in a special place—the blood bank.",
    "The pony couldn't sing because it was a little horse.",
    "If two vegetarians get in an argument, is it still called beef?",
    "RIP boiling water, you will be mist.",
    "I told my doctor I heard buzzing, but she said it's just a bug that's going around.",
    "I ate a clock the other day. It was very time consuming.",
    "I have a clean conscious—it's never been used.",
    "I once wrote a song about a tortilla, but it's more of a wrap.",
    "You can tell it's a dogwood tree from its bark.",
    "When does a joke turn into a dad joke? When it becomes apparent.",
    "They say that 3/2 people are bad at fractions.",
    "Dogs can't operate MRI machines but catscan.",
    "A witch's vehicle goes brrrroom brrrroom!",
    "I'm worried for the calendar because its days are numbered.",
    "Dear Math, it's time to grow up and solve your own problems.",
    "I only know 25 letters of the alphabet—I don't know y.",
    "I just don't trust stairs, they're always up to something.",
    "I used to play piano by ear, but now I use my hands.",
    "Why were the utensils stuck together? They were spooning. ",
    "How do celebrities stay cool? They have many fans. ",
    "Why did the picture go to prison? Because it was framed.",
    "How does a hurricane see? With one eye.",
    "Where do polar bears keep their money? The snow bank.",
    "What's a tornado's favorite game? Twister!",
    "How does the moon cut his hair? Eclipse it.",
    "What do you call a funny mountain? Hill-arious.",
    "What gets wetter the more it dries? A towel.",
    "What did the banana say to the boy? Nothing, bananas can't talk!",
    "What rock group has four men who don't sing? Mount Rushmore.",
    "My boss told me to have a good day, so I went home!",
    "What do you call cheese that isn't yours? Nacho cheese.",
    "\"Did you get your haircut?\" No, I got them all cut. ",
    "I was wondering why the frisbee kept getting bigger and bigger. Then it hit me.",
    "Wanna hear a joke about paper? Never mind. It's tearable.",
    "How many apples grow on a tree? All of them!",
    "I talk to myself because sometimes I just need expert advice. ",
    "I used to be addicted to the hokey-pokey until I turned myself around.",
    "What concert would cost only 45 cents? 50 Cent featuring Nickelback!",
    "What do you call someone who tells dad jokes but isn't a dad? A faux pa.",
    "I could tell a joke about pizza, but it's a little cheesy.",
    "If you see a crime at an Apple store, are you an iWitness? ",
    "I love telling Dad jokes. Sometimes he even laughs.",
    "I hate Velcro. It's a rip off.",
    "Spring is here! I got so excited that I wet my plants.",
    "I had to sell my vacuum cleaner. All it was doing was gathering dust.",
    "Do you know how many people are dead at a cemetery? All of them.",
    "\"I'll call you later.\" Don't call me later, call me Dad.",
    "If the early bird gets the worm, I'll sleep in until there's pancakes.",
    "The wedding was so beautiful, even the cake was in tiers.",
    "Why are spiders so smart? They can find everything on the web. ",
    "What do you call a toothless bear? A gummy bear! ",
    "What do you give a sick lemon? Lemon-aid.",
    "What did the nose tell the finger? Stop picking on me!",
    "Why can't your hand be 12 inches long? Because then it would be a foot.",
    "What kind of car does a sheep like to drive? A lamborghini. ",
    "What key is used to open bananas? A mon-key.",
    "What has four wheels and flies? A garbage truck.",
    "How do you talk to a giant? You use big words!",
    "How do you make a tissue dance? Put a little boogie in it!",
    "What kind of milk comes from a pampered cow? Spoiled milk.",
    "What's a sea monster's favorite lunch? Fish and ships.",
    "What do you call an alligator in a vest? An investigator.",
    "Can a kangaroo jump higher than a house? Of course, houses can't jump.",
    "Why are pigs so bad at sports? They always hog the ball.",
    "Why shouldn't you tell an egg a joke? It'll crack up.",
    "What's a foot long and slippery? A slipper.",
    "Why did the scarecrow win an award? He was outstanding in his field.",
    "What's a ninja's favorite type of shoes? Sneakers!",
    "What's orange and sounds like a parrot? A carrot!",
    "How does a penguin build a house? Igloos it together.",
    "Why is no one friends with Dracula? He's a pain in the neck.",
    "Where do you learn all about ice cream? Sundae school.",
    "Which bear is the most condescending? A pan-duh!",
    "What kind of noise does a witch’s vehicle make? Brrrroooom, brrroooom.",
    "What’s brown and sticky? A stick.",
    "Two guys walked into a bar. The third guy ducked.",
    "How do you get a country girl’s attention? A tractor.",
    "Why are elevator jokes so classic and good? They work on many levels.",
    "What do you call a pudgy psychic? A four-chin teller.",
    "What did the police officer say to his belly-button? You’re under a vest.",
    "What do you call it when a group of apes starts a company? Monkey business.",
    "My wife asked me to stop singing “Wonderwall” to her. I said maybe...",
    "What kind of drink can be bitter and sweet? Reali-tea.",
    "What do you call a naughty lamb dressed up like a skeleton for Halloween? Baaad to the bone.",
    "Want to know why nurses like red crayons? Sometimes they have to draw blood.",
    "What would the Terminator be called in his retirement? The Exterminator.",
    "What did Tennessee? The same thing as Arkansas.",
    "My wife asked me to go get 6 cans of Sprite from the grocery store. I realized when I got home that I had picked 7 up.",
    "Why do bees have sticky hair? Because they use a honeycomb.",
    "Why do some couples go to the gym? Because they want their relationship to work out.",
    "What do you call an angry musician flipping someone off? A song bird.",
    "What’s the most detail-oriented ocean? The Pacific.",
    "Did you hear about the kidnapping at school? It’s fine, he woke up.",
    "How can you tell it’s a dogwood tree? By the bark.",
    "My boss told me to have a good day, so I went home.",
    "Why did the man fall down the well? Because he couldn’t see that well.",
    "When does a joke become a “dad joke?” When it becomes apparent.",
    "Why is Peter Pan always flying? Because he Neverlands.",
    "Which state has the most streets? Rhode Island.",
    "What do you call 26 letters that went for a swim? Alphawetical.",
    "What’s the name of a very polite, European body of water? Merci.",
    "Why was the color green notoriously single? It was always so jaded.",
    "I used to hate facial hair, but then it grew on me.",
    "I want to make a brief joke, but it’s a little cheesy.",
    "Why did the coach go to the bank? To get his quarterback.",
    "How do celebrities stay cool? They have many fans.",
    "Sundays are always a little sad, but the day before is a sadder day.",
    "5/4 of people admit they’re bad at fractions.",
    "Why did the bedding hide their relationship? They just wanted something pillow-key!",
    "You’re American when you go into a bathroom and when you come out, but what are you while you’re in the bathroom? European.",
    "I’ve been thinking about taking up meditation. I figure it’s better than sitting around doing nothing.",
    "Dogs can’t operate MRI machines. But catscan.",
    "What did the flowers do when the bride walked down the aisle? They rose.",
    "It takes guts to be an organ donor.",
    "What does \"Rockin' Robin\" do when she's bored? Tweet.",
    "I lost my job at the bank on my first day. A woman asked me to check her balance, so I pushed her over.",
    "How do you row a canoe filled with puppies? Bring out the doggy paddle.",
    "Singing in the shower is fun until you get soap in your mouth. Then it becomes a soap opera.",
    "Why were the utensils stuck together? They were spooning.",
    "What's a crafty dancer's favorite hobby? Cutting a rug.",
    "How does a penguin build his house? Igloos it together.",
    "What kind of music do chiropractors like? Hip pop.",
    "What kind of shoes does a lazy person wear? Loafers.",
    "Why is cold water so insecure? Because it’s never called hot.",
    "I was going to tell a time-traveling joke, but you guys didn’t like it.",
    "Shouldn’t the “roof” of your mouth actually be called the ceiling?",
    "Stop looking for the perfect match…use a lighter.",
    "I told my doctor I heard buzzing, but he said it’s just a bug going around.",
    "What kind of car does a sheep like to drive? A lamborghini.",
    "What did the accountant say while auditing a document? This is taxing.",
    "What did the two pieces of bread say on their wedding day? It was loaf at first sight.",
    "If the early bird gets the worm, I’ll sleep in until there’s pancakes.",
    "Why do melons have weddings? Because they cantaloupe.",
    "I signed up for a marathon, but how will I know if it’s the real deal or just a run through?",
    "When you have a bladder infection, urine trouble.",
    "What did the drummer call his twin daughters? Anna One, Anna Two!",
    "What did the juicer say to the orange during self-quarantine? Can’t wait to squeeze you!",
    "What do you call a toothless bear? A gummy bear!",
    "Want to hear a joke about construction? I’m still working on it.",
    "Someone told me that I should write a book. I said, “That’s a novel concept.”",
    "Two goldfish are in a tank. One says to the other, “Do you know how to drive this thing?”",
    "What’s Forrest Gump’s password? 1forrest1",
    "I tell dad jokes, but I don’t have any kids. I’m a faux pa.",
    "What does a nosey pepper do? It gets jalapeño business.",
    "If a child refuses to nap, are they guilty of resisting a rest?",
    "Why do dads feel the need to tell such bad jokes? They just want to help you become a groan up.",
    "I know a lot of jokes about retired people, but none of them work.",
    "Why are spiders so smart? They can find everything on the web.",
    "RIP boiled water—you will be mist.",
    "What do you call two octopuses that look the same? Itenticle.",
    "What has one head, one foot, and four legs? A bed.",
    "Sore throats are a pain in the neck.",
    "What does a house wear? Address.",
    "Why did the scarecrow win an award? He was out standing in his field.",
    "What’s red and smells like blue paint? Red paint.",
    "My son asked me to put his shoes on, but I don’t think they’ll fit me.",
    "I’ve been bored recently, so I decided to take up fencing. The neighbors keep demanding that I put it back.",
    "What do you call an unpredictable camera? A loose Canon.",
    "I didn’t get a haircut, I got them all cut.",
    "Which U.S. state is known for its especially small soft drinks? Minnesota.",
    "What do sprinters eat before a race? Nothing—they fast.",
    "What did one Dorito farmer say to the other? “Cool Ranch!”",
    "Why couldn’t the bicycle stand up by itself? It was two-tired.",
    "I’m so good at sleeping, I can do it with my eyes closed.",
    "People are usually shocked that I have a Police record. But I love their greatest hits!",
    "I told my girlfriend she drew on her eyebrows too high. She seemed surprised.",
    "What do you call a fibbing cat? A lion.",
    "Why shouldn’t you write with a broken pencil? Because it’s pointless.",
    "I like telling Dad jokes…sometimes he laughs.",
    "How do you weigh a millennial? In Instagrams.",
    "The wedding was so beautiful, even the cake was in tiers.",
    "What’s the most patriotic sport? Flag football.",
    "Why were spectators confused by the koala's self-portrait? It was bear.",
    "Why did the envelope take so long to get ready? It had to get addressed.",
    "What does a karate master get rewarded with while driving? A seat belt.",
    "What did the husband say to his wife right after getting LASIK surgery? \"Aren't you a sight for sore eyes?\"",
    "What do lions use to look at their manes? Mirroars.",
    "What did the dad say when his golden retriever was caught eating a hot dog? \"It's a dog eat dog world out there.\"",
    "Do mascara and lipstick ever argue? Sure, but then they makeup.",
    "What piece on the playground is always exhausted? The tire swing.",
    "Why did two tall people get along so well? The could really see eye to eye.",
    "Why was the gossip disliked at the coffee shop? She always spilled the tea.",
    "What does a writer have in common with a football player? Anxiety over a rough draft.",
    "Where do wasps like to get lunch? A bee-stro.",
    "Why would doors do well on social media? Everyone looks for their handles.",
    "Which bathroom appliance would be the worst life preserver? The sink.",
    "Why was the dad sitting on a pack of playing cards? His kid asked him to sit on the deck.",
    "What kind of bird is always getting hurt? The owl.",
    "What's either a really gross animal issue OR an impressive, magical school? Hogwarts.",
    "What did the dishwasher say to the oven after a productive day? \"You've been on fire!\"",
    "Why did the cashier rip money in half? They were asked to break a bill.",
    "What did one furniture maker say to another during a tense discussion? \"Let's table this.\"",
    "Why was the ghost so tired? He worked the graveyard shift.",
    "Why do pancakes always win at baseball? They have the best batter.",
    "Why couldn't the couple get married at the library? It was all booked up.",
    "How did the dad prank his daughter using fake dog poop on April Fools Day? He told her to look out for her new sham-poo in the shower.",
    "What did the air conditioner say when it met a celebrity? \"I'm a big fan.\"",
    "What was Sherlock Holmes' favorite protein source? Mystery meat.",
    "What did the dryer say to the boring duvet cover that just got out of the washer? \"Don't be such a wet blanket.\"",
    "Why was the cow such a heartthrob on the farm? He was a s-moo-th talker.",
    "What's a writer's favorite train station? Penn Station.",
    "What was said about the messy, angry man who was eating a can of Pringles? \"He's got a chip on his shoulder.\"",
    "What's it called when kittens get stuck in a tree? A cat-astrophe.",
    "What kind of shape may have been knighted? Cir-cles.",
    "Why is sand so optimistic? It has a can-dune attitude.",
    "What part of the museum makes everyone sneeze? The sta-tues.",
    "What did the baker say when she won an award? \"It was a piece of cake.\"",
    "Why couldn't the couple respond right away when looking at wedding venues? They were engaged.",
    "What is Marco's favorite clothing store? Polo.",
    "What do you call it when a lawyer takes a test early in the morning? A breakfast bar.",
    "What do frogs use to track their exercise? Fit (rib)bits.",
    "What kind of cleaning product feels a lot of motivation in life? All-purpose.",
    "Where was the dripping coming from in the fridge? The leeks.",
    "Why was the hockey player gifted a new cap? He was known for his hat tricks.",
    "What vegetable is kind to everyone? The sweet potato.",
    "How was the handsome runner described? \"Dashing.\"",
    "What animals are the best to call if you get locked out of your house? Monkeys.",
    "What did the geometry teacher say when the class had trouble solving a problem? \"Let's try a different angle.\"",
    "Why don't phones ever go hungry? They have plenty of apps to choose from.",
    "Why couldn't the family leave the room after playing with Legos? They were blocked.",
    "What makes a basketball court trendy and accessorized? The hoops.",
    "What did the sapphire's best friend tell her? \"You're a real gem.\""
]